Merge pull request #52 from vladdum/docs/mermaid-diagrams
